// if(вираз який має визначати true or false){
// якщо вираз буде true то ми заходимо середену ціло цього if
// }

// if(true){
//     console.log('Hello');

// }

// const age = 18;
// const userAge = Number(prompt('How old are you:'));
// console.log(userAge);
// if (userAge>=age){
//   console.log(alert('Ви вповнолітні'));
// }else{
//       console.log(alert('Ви не вповнолітні'));
// }

// const userAge = Number(prompt('How old are you:'));
// let resalt = '';
// if (userAge<18) {
//     resalt = 'ви неповнолітній'
// }else if(userAge>=18 && userAge<60){
//     resalt = 'дорослий'
// }else {
//     resalt = 'Старий'
// }
// console.log(resalt);

// const resalt = (10>5)?'yes':'no';
// console.log(resalt); // yes





// Напиши скрипт який перевіряє можливість відкрити чат з користувачем. Для цього користувач має бути:
// другом
// онлайн
// без режиму не турбувати
// const isOnline = false;
// const isFriend = true;
// const isDnd = false;
// if (!isOnline && !isDnd && isFriend) {
//     console.log('чат дозволено');
    
    
// }






// Напиши скрипт перевірки підписки користувачапід
//  час доступу до контенту. Є три типи підпистки: 
// free, pro та vip. Отримати доступ можуть тільки pro та vip.
// const userStatus = prompt('Який в тебе сатус? free pro vip').trim().toLowerCase();
// if(userStatus === 'pro' || userStatus === 'vip'){
// console.log('у вас є доступ');
// }else{
//     console.log('у вас нема доступу');
    
// }





// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
//  - Загальна сума витрачених коштів зберігається в змінній totalSpent
//  - Сума поточного платежа зберігається в змінній payment
//  - Знижка зберігається в змінній discount

//  - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//  - Якщо витрачено менше 100) - не партнер, знижка 0%

//  - В результаті вивести повідомлення
//  «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

const totalSpent = Number(prompt('скільки витратрачено:'));

if(totalSpent>=100 && totalSpent<=1000){
    console.log(alert(`Оформляемо замовлення на суму ${totalSpent} зі знижкою 2%`));
}else if(totalSpent>1000 && totalSpent<=5000){
console.log(alert(`Оформляемо замовлення на суму ${totalSpent} зі знижкою 5%`));
}else if(totalSpent>5000){
console.log(alert(`Оформляемо замовлення на суму ${totalSpent} зі знижкою 10%`));
}else{
    console.log(alert(`У вас ще немає партнерської знижки`));
}