// const a = [1,2,3];
// const b = [4,5,6];
// const c = [7,8,9];
// const result = a.concat(b,c);
// console.log(result);
// ////////////////////////////////////////


// const num = [1,2,3,4,5,6,7,8,9,10];
// const cop = num.slice()
// // видалення елементів splice (початковий індекс , кількість елементів )
// const result = cop.splice(0,3);
// console.log(result);

// const ran = [1,245,45678,3456789,567890,4567890,777,234567,3456];
// // const indexRan = ran.indexOf(777);
// // ran.splice(indexRan,1);
// // console.log(ran);


// // // додавання елемнтів в масив splice(початковий індекс , 0, додати)
// // ran.splice(4,0,'nazik',1234567890,1234567890)
// // console.log(ran);
// // // замінна видалення елемнтуу -тів
// ran.splice(2,1,11111)
// console.log(ran);
//Задача 1 Створіть масив styles з елементами 'Джаз' i 'Блюз'. Додайте
//  'Рок-н-ролл' в кінець масиву. Замініть значення в середині масиву на 
// 'Класика'. Видаліть перший елемент масиву і покажіть його. Додайте 'Реп' 
// і 'Реггі' на початок масиву. Виведіть масив в консоль.

// const styles =['Джаз' , 'Блюз']
// styles.push('Рок-н-ролл')
// styles.splice(1,1,'Класика')
// styles.unshift('реп','перррі')
// console.log(styles);

// Створіть масив фруктів, для якого:
// 1) За допомогою методів масиву видаліть спочатку та скінця по фрукту,
// на їхнє місце додати нові фрукти.
//  2) Видалити 3 елемент, та на його місце вставити декілька інших фруктів використовуючи метод splice;
//
//
const fruits = ["apple", "banana", "orange", "watermelon"];
fruits.pop()
fruits.shift()
fruits.unshift('груша')
fruits.push('ананас')
fruits.splice(2,1,'абрикос','мандарін')
console.log(fruits);